Revit 2027 API
ParameterTypeId.ExcavationVolume Property
 "Excavation Volume"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExcavationVolume { get; }
Public Shared ReadOnly Property ExcavationVolume As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExcavationVolume {
	ForgeTypeId^ get ();
}
static member ExcavationVolume : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace